{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 4, "W_constraint": null, "nb_filter": 48, "bias": true, "border_mode": "valid", "activation": "linear", "b_constraint": null, "nb_row": 4, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "batch_input_shape": [null, 99, 99, 3], "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_1", "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "b_regularizer": null, "W_constraint": null, "nb_filter": 48, "bias": true, "activation": "linear", "b_constraint": null, "nb_row": 5, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "b_regularizer": null, "W_constraint": null, "nb_filter": 48, "bias": true, "activation": "linear", "b_constraint": null, "nb_row": 3, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_3"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 4, "b_regularizer": null, "W_constraint": null, "nb_filter": 48, "bias": true, "activation": "linear", "b_constraint": null, "nb_row": 4, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_4"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 4, "b_regularizer": null, "W_constraint": null, "nb_filter": 48, "bias": true, "activation": "linear", "b_constraint": null, "nb_row": 4, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_5"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 200, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "bias": true, "activation": "softmax", "b_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 2, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "name": "dense_2"}}], "keras_version": "1.1.2"}