{"config": [{"config": {"border_mode": "valid", "nb_row": 4, "input_dtype": "float32", "dim_ordering": "tf", "nb_col": 4, "activity_regularizer": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "trainable": true, "b_regularizer": null, "batch_input_shape": [null, 99, 99, 3], "nb_filter": 48, "name": "convolution2d_1", "W_constraint": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "valid", "nb_row": 5, "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "nb_filter": 48, "name": "convolution2d_2", "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "valid", "nb_row": 3, "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "nb_filter": 48, "name": "convolution2d_3", "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "valid", "nb_row": 4, "dim_ordering": "tf", "nb_col": 4, "activity_regularizer": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "nb_filter": 48, "name": "convolution2d_4", "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "same", "nb_row": 4, "dim_ordering": "tf", "nb_col": 4, "activity_regularizer": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "nb_filter": 48, "name": "convolution2d_5", "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_4", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "trainable": true, "output_dim": 200, "name": "dense_1", "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "softmax", "trainable": true, "output_dim": 2, "name": "dense_2", "input_dim": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}