{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "input_dtype": "float32", "W_constraint": null, "trainable": true, "activation": "linear", "batch_input_shape": [null, 99, 99, 3], "b_constraint": null, "nb_col": 4, "nb_filter": 48, "W_regularizer": null, "bias": true, "name": "convolution2d_1", "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 4, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "activation": "linear", "trainable": true, "nb_col": 5, "nb_filter": 48, "W_regularizer": null, "bias": true, "name": "convolution2d_2", "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 5, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "activation": "linear", "trainable": true, "nb_col": 3, "nb_filter": 48, "W_regularizer": null, "bias": true, "name": "convolution2d_3", "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "activation": "linear", "trainable": true, "nb_col": 4, "nb_filter": 48, "W_regularizer": null, "bias": true, "name": "convolution2d_4", "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 4, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_4", "trainable": true, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "trainable": true, "output_dim": 200, "W_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "b_constraint": null, "activation": "softmax", "trainable": true, "output_dim": 2, "W_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "input_dim": null}}]}