{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "bias": true, "activation": "linear", "b_regularizer": null, "b_constraint": null, "input_dtype": "float32", "nb_row": 4, "dim_ordering": "tf", "trainable": true, "nb_filter": 48, "batch_input_shape": [null, 99, 99, 3], "border_mode": "valid", "nb_col": 4, "init": "glorot_uniform", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_filter": 48, "activity_regularizer": null, "trainable": true, "activation": "linear", "b_regularizer": null, "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_2", "subsample": [1, 1], "border_mode": "valid", "nb_col": 5, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_filter": 48, "activity_regularizer": null, "trainable": true, "activation": "linear", "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_3", "subsample": [1, 1], "border_mode": "valid", "nb_col": 3, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_filter": 48, "activity_regularizer": null, "trainable": true, "activation": "linear", "b_regularizer": null, "b_constraint": null, "nb_row": 4, "dim_ordering": "tf", "name": "convolution2d_4", "subsample": [1, 1], "border_mode": "valid", "nb_col": 4, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_4", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "name": "dense_1", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "linear", "bias": true, "b_constraint": null, "input_dim": null, "output_dim": 200, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "name": "dense_2", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "softmax", "bias": true, "b_constraint": null, "input_dim": null, "output_dim": 2, "init": "glorot_uniform"}}]}