{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 4, "b_constraint": null, "activation": "linear", "b_regularizer": null, "nb_filter": 48, "W_constraint": null, "batch_input_shape": [null, 99, 99, 3], "bias": true, "dim_ordering": "tf", "nb_row": 4, "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "input_dtype": "float32", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "b_constraint": null, "activation": "linear", "b_regularizer": null, "nb_filter": 48, "W_constraint": null, "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "nb_row": 5, "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "b_constraint": null, "activation": "linear", "b_regularizer": null, "nb_filter": 48, "W_constraint": null, "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 4, "b_constraint": null, "activation": "linear", "b_regularizer": null, "nb_filter": 48, "W_constraint": null, "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "nb_row": 4, "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_4", "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 200, "name": "dense_1", "trainable": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "b_constraint": null, "activation": "softmax", "b_regularizer": null, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 2, "name": "dense_2", "trainable": true, "activity_regularizer": null}}]}