{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 4, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 4, "input_dtype": "float32", "batch_input_shape": [null, 99, 99, 3], "bias": true, "name": "convolution2d_1", "b_constraint": null, "subsample": [1, 1], "nb_filter": 48, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_2", "nb_col": 5, "bias": true, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "nb_filter": 48, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 3, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_3", "nb_col": 3, "bias": true, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "nb_filter": 48, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 4, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_4", "nb_col": 4, "bias": true, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "nb_filter": 48, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "trainable": true, "nb_row": 4, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_5", "nb_col": 4, "bias": true, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "nb_filter": 48, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_4", "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "output_dim": 200, "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "input_dim": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "output_dim": 2, "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "input_dim": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "activation": "softmax"}}], "keras_version": "1.1.2"}